10/data/attachments/ca8c9deefea95dd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_528b1305-2d63-4886-9072-5a84b127039a</nif:username>
            <nif:friendToBeAdded>Daniel_bed_Friend_99004_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>